<template>
	<view class="tip">
		<view v-if="type == '用户协议'">
			<text>
				“子诺新微金”在此特别提醒您（用户）在注册成为用户之前，请认真阅读本《用户协议》（以下简称“协议”），确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。
				本协议约定“子诺新微金”与用户之间关于“子诺新微金”软件服务（以下简称“服务”）的权利义务。“用户”是指注册、登录、使用本服务的个人。本协议可由“子诺新微金”随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本网站查阅最新版协议条款。在“子诺新微金”修改协议条款后，如果用户不接受修改后的条款，请立即停止使用“子诺新微金”提供的服务，用户继续使用“子诺新微金”提供的服务将被视为接受修改后的协议。
			</text>
			<view>
				<text>一、帐号注册</text>
				<text>
					1、用户在使用本服务前需要注册一个“子诺新微金”帐号。“子诺新微金”帐号应当使用手机号码注册，请用户使用尚未注册“子诺新微金”帐号的手机号码，以及未被封禁的手机号码注册“子诺新微金”帐号。“子诺新微金”可以根据用户需求或产品需要对帐号注册和绑定的方式进行变更，而无须事先通知用户。
					2、鉴于“子诺新微金”帐号的注册方式，您同意注册时将使用您提供的手机号码用于注册。 3、“子诺新微金”软件服务仅面向成年人使用，任何18岁以下的用户不得下载和使用本服务。
				</text>
			</view>
			<view>
				<text>二、服务内容</text>
				<text>
					1、本服务的具体内容由子诺新微金根据实际情况提供,包括但不限于授权用户通过其帐号进行上传照片、资料填写、学习求助。可以对其提供的服务予以变更,用户将会收到子诺新微金”关于服务变更的通知。
					2、子诺新微金提供的服务包含免费服务与收费服务。用户可以通过付费方式购买收费服务,对于收费服务,子诺新微金会在用户使用之前给予用户明确的提示,只有用户根据提示确认其同意按照前述支付方式支付费用并完成了支付行为,用户才能使用该等收费服务。支付行为的完成以银行或第三方支付平台生成支付已完成的确认通知为准。
				</text>
			</view>
			<view>
				<text>三、所需获取的权限</text>
				<text>
					1、照片 当您上传照片时,我们会需要您开启获取照片权限,从而为您提供发布照片的服务。 2、相机
					当您需要拍照上传照片时,我们会需要您开启获取相机权限,从而为您提供拍照上传照片的服务。 3、通知 我们会需要您开启通知的权限,以便为您提供实时消息提醒的服务。 4、蜂窝移动数据
					我们会需要您开启蜂窝移动数据权限,以便为您提供网络服务。
				</text>
			</view>
			<view>
				<text>四、用户个人隐私信息保护</text>
				<text>
					1、用户在注册帐号或使用本服务的过程中,可能需要填写或提交一些必要的信息,如法律法规、规章规范性文件(以下称法律法规)规定的需要填写的身份信息如用户提交的信息不完整或不符合法律法规的规定,则用户可能无法使用本服务或在使用本服务的过程中受到限制。
					2、尊重用户个人隐私信息的私有性是子诺新微金”的一贯制度,子诺新微金将采取技术措施和其他必要措施,确保用户个人隐私信息安全,防止在本服务中收集的用户个人隐私信息泄露、毁损或丢失。在发生前述情形或者子诺新微金”发现存在发生前述情形的可能时,将及时采取补救措施。
					(1) “子诺新微金”向用户及时发送重要通知，如软件更新、本协议条款的变更； (2) “子诺新微金”内部进行审计、数据分析和研究等，以改进“子诺新微金”的产品、服务和与用户之间的沟通；
					(3)用户自行向第三方公开其个人隐私信息 (4)用户与“子诺新微金”及合作单位之间就用户个人隐私信息的使用公开达成约定,“子诺新微金”因此向合作单位公开用户个人隐私信息
					(5)任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息的泄露。 3、用户同意子诺新微金可在以下事项中使用用户的个人隐私信息: (1)
					“子诺新微金”向用户及时发送重要通知，如软件更新、本协议条款的变更； (2) “子诺新微金”内部进行审计、数据分析和研究等，以改进“子诺新微金”的产品、服务和与用户之间的沟通；
					(3)依本协议约定“子诺新微金”管理、审查用户信息及进行处理措施; (4)《隐私协议》中的有关处理措施 (5)适用法律法规规定的其他事项。
					除上述事项外,如未取得用户事先同意,子诺新微金不会将用户个人隐私信息使用于任何其他用途。
					4、为了改善“子诺新微金”的技术和服务,向用户提供更好的服务体验,“子诺新微金”或可会自行收集使用或向第三方提供用户的非个人隐私信息。
				</text>
			</view>
			<view>
				<text>五、使用规则</text>
				<text>
					1、用户在本服务中或通过本服务所传送、发布的任何内容并不反映或代表,也不得被视为反映或代表 “子诺新微金”的观点、立场或政策,“子诺新微金”对此不承担任何责任。
					2、用户不得利用"子诺新微金"帐号或本服务进行如下行为 (1)提交、发布虚假信息,或盗用他人头像或资料,冒充、利用他人名义的 (2)强制、诱导其他用户关注、点击链接页面或分享信息的
					(3)虚构事实、隐蹒真相以误导、欺骗他人的; (4)利用技术手段批星建立虚假帐号的 (5)利用"子诺新微金"帐号或本服务从事任何违法犯罪活动的;
					(6)制作、发布与以上行为相关的方法、工具,或对此类方法、工具进行运营或传播,无论这些行为是 否为商业目的;
					(7)其他违反法律法规规定、侵犯其他用户合法权益、干扰子诺新微金'正常运营或X∝子诺新微金未明示授权的 行为
					3、用户须对利用"子诺新微金帐号"或本服务传送信息的真实性、合法性、无害性、准确性、有效性等全权
					负责,与用户所传播的信息相关的任何法律责任由用户自行承担,与子诺新微金无关。如因此给"XX软 件"或第三方造成损害的,用户应当依法予以赔偿。
					4、"子诺新微金"提供的服务中可能包括广告,用户同意在使用过程中显示“子诺新微金”和第三方供应商、合
					作伙伴提供的广告。除法律法规明确规定外,用户应自行对依该广告信息进行的交易负责,对用户因依
					该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害,“子诺新微金”不承担任何责任。
				</text>
			</view>
			<view>
				<text>六、账户管理</text>
				<text>
					1、“子诺新微金”帐号的所有权归我司所有,用户完成申请注册手续后,获得“子诺新微金”帐号的使用权,该
					使用权仅属于初始申请注册人,禁止赠与、借用、租用、转让或售卖。我司因经营需要,有权回收用户 的“子诺新微金”帐号。
					2、用户可以更改、删除“子诺新微金”帐户上的个人资料、注册信息及传送内容等,但需注意,删除有关信 息的同时也会删除用户储存在系统中的文字和图片。用户需承担该风险。
					3、用户有责任妥善保管注册帐号信息及帐号密码的安全,因用户保管不善可能导致遭受盗号或密码失
					窃,责任由用户自行承担。用户需要对注册帐号以及空码下的行为承担法律责任。用户同意在任何情况
					下不使用其他用户的帐号或密码。在用户怀疑他人使用其帐号或密码时,用户同意立即通知我司 4、用户应遵守本协议的各项条款,正确、适当地使用本服务,如因用户违反本协议中的任何条款,我
					司在通知用户后有权依据协议中断或终止对违约用户“子诺新微金”帐号提供服务。同时,我司保留在任何 时候收回“子诺新微金”帐号、用户名的权利。
					5、如用户注册“子诺新微金”帐号后一年不登录,通知用户后,我司可以收回该帐号,以兔造成资源浪费 由此造成的不利后果由用户自行承担
				</text>
			</view>
			<view>
				<text>七、风险承担</text>
				<text>
					1、用户理解并同意,“子诺新微金”仅为用户提供信息分享、传送及获取的平台,用户必须为自己注册帐号下的一切行为负责,包括用户所传送的任何内容以及由此产生的任何后果。用户应对“子诺新微金”及本服务中的内容自行加以判断,并承担因使用内容而引起的所有风险,包括因对内容的正确性、完整性或实用性的依赖而产生的风险。“子诺新微金”无法且不会对因用户行为而导致的任何损失或损害承担责任。如果用户发现任何人违反本协议约定或以其他不当的方式使用本服务,请立即向我司举报或投诉,我司将依本协议约定进行处理。
					2、用户理解并同意,因业务发展需要,“子诺新微金”保留单方面对本服务的全部或部分服务内容变更、暂停、终止或撤销的权利,用户需承担此风险。
				</text>
			</view>
			<view>
				<text>八、知识产权声明</text>
				<text>
					1、除本服务中涉及广告的知识产权由相应广告商享有外,“子诺新微金”在本服务中提供的内容(包括但不限于网页、文字、图片、音频、视频、图表等)的知识产权均归软件所有,但用户在使用本服务前对自己发布的内容已合法取得知识产权的除外。
					2、除另有特别声明外,XXX软件提供本服务时所依托软件的著作权、专利权及其他知识产权均归“子诺新微金”所有。
					3、“子诺新微金”在本服务中所涉及的图形文字或其组成,以及其他“子诺新微金”标志及产品、服务名称,其著作权或商标权归我司所有。未经我司事先书面同意,用户不得将“子诺新微金”标识以任何方式展示或使用或作其他处理,也不得向他人表明用户有权展示、使用、或其他有权处理“子诺新微金”标识的行为
					4、上述及其他任何“子诺新微金”或相关广告商依法拥有的知识产权均受到法律保护,未经我司或相关广告商书面许可,用户不得以任何形式进行使用或创造相关衍生作品。
				</text>
			</view>
			<view>
				<text>九、服务的变更、中断、终止</text>
				<text>
					1、鉴于网络服务的特殊性,用户同意“X软件”有权随时变更、中断或终止部分或全部的服务(包括收费服务)。“X软件”变更、中断或终止的服务,“X软件”应当在变更、中断或终止之前通知用户,并向受影响的用户提供等值的替代性的服务
					2、如发生下列任何一种情形“X软件”有权变更、中断或终止向用户提供的免费服务或收费服务,而无需对用户或任何第三方承担任何责任：
					(1)根据法律规定用户应提交真实信息,而用户提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明 (2)用户违反相关法律法规或本协议的约定;
					(3)按照法律规定或有权机关的要求 (4)出于安全的原因或其他必要的情形。
				</text>
			</view>
		</view>
		<view v-else>
			<text>我们非常重视用户隐私政策并严格遵守相关的法律规定。请您仔细阅读《隐私政策》后再继续使用。如果您继续使用我们的服务，表示您已经充分阅读和理解我们协议的全部内容。
我们尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更优质的服务，我们会按照本隐私权政策的规定使用和披露您的个人信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，我们不会将这些信息对外披露或向第三方提供。我们会不时更新本隐私权政策。您在同意我们服务使用协议之时，即视为您已经同意本隐私权政策全部内容。
</text>
			<view>
				<text>
					1. 适用范围
					
					(a) 在您注册本应用app帐号时，您根据app要求提供的个人注册信息；
					
					(b) 在您使用本应用网络服务，或访问本应用平台网页时，本应用自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；
					
					(c) 本应用通过合法途径从商业伙伴处取得的用户个人数据。
					
					(d)本应用严禁用户发布不良信息，如裸露、色情和亵渎内容，发布的内容我们会进行审核，一经发现不良信息，会禁用该用户的所有权限，予以封号处理。
					
					2. 信息使用
					
					(a)本应用不会向任何无关第三方提供、出售、出租、分享或交易您的个人登录信息。如果我们存储发生维修或升级，我们会事先发出推送消息来通知您，请您提前允许本应用消息通知。
					
					(b) 本应用亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何本应用平台用户如从事上述活动，一经发现，本应用有权立即终止与该用户的服务协议。
					
					(c) 为服务用户的目的，本应用可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息，或者与本应用合作伙伴共享信息以便他们向您发送有关其产品和服务的信息（后者需要您的事先同意）。
					
					3. 信息披露
					
					在如下情况下，本应用将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：
					
					(a) 未经您事先同意，我们不会向第三方披露；
					
					(b)为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；
					
					(c) 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；
					
					(d) 如您出现违反中国有关法律、法规或者本应用服务协议或相关规则的情况，需要向第三方披露；
					
					(e) 如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；
					
					4. 信息存储和交换
					
					本应用收集的有关您的信息和资料将保存在本应用及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本应用收集信息和资料所在地的境外并在境外被访问、存储和展示。
					
					5. Cookie的使用
					
					(a) 在您未拒绝接受cookies的情况下，本应用会在您的计算机上设定或取用cookies ，以便您能登录或使用依赖于cookies的本应用平台服务或功能。本应用使用cookies可为您提供更加周到的个性化服务，包括推广服务。
					
					(b) 您有权选择接受或拒绝接受cookies。您可以通过修改浏览器设置的方式拒绝接受cookies。但如果您选择拒绝接受cookies，则您可能无法登录或使用依赖于cookies的本应用网络服务或功能。
					
					(c) 通过本应用所设cookies所取得的有关信息，将适用本政策。
					
					6.本隐私政策的更改
					
					(a)如果决定更改隐私政策，我们会在本政策中、本公司网站中以及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。
					
					(b)本公司保留随时修改本政策的权利，因此请经常查看。如对本政策作出重大更改，本公司会通过网站通知的形式告知。
					
					方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是本应用用户名及密码发生泄露，请您立即联络本应用客服，以便本应用采取相应措施。
					
					感谢您花时间了解我们的隐私政策！我们将尽全力保护您的个人信息和合法权益，再次感谢您的信任！
				</text>
			</view>
		</view>
	</view>
</template>

<script>
export default {
	data() {
		return {
			type: ''
		};
	},
	onLoad(e) {
		if(e.type == '1'){
			this.type = '用户协议'
		}else{
			this.type = '隐私政策'
		}
		uni.setNavigationBarTitle({
			title: this.type
		});
	},
	methods: {}
};
</script>

<style lang="scss">
.tip {
	width: 700rpx;
	padding: 26rpx;
	text {
		// width: 750rpx;
		font-size: 24rpx;
		color: #000000;
		line-height: 40rpx;
		text-align: justify;
	}
}
</style>
